[
    {
      "Month": "September",
      "Day": 18,
      "Year": 1931,
      "Text": "Japan invades Manchuria."
    },
    {
      "Month": "October",
      "Day": 2,
      "Year": 1935,
      "Text": "Fascist Italy invades, conquers, and annexes Ethiopia."
    },
    {
      "Month": "October",
      "Day": 1,
      "Year": 1936,
      "Text": "Nazi Germany and Fascist Italy sign a treaty of cooperation on October 25. On November 1, the Rome-Berlin Axis is announced."
    },
    {
      "Month": "November",
      "Day": 25,
      "Year": 1936,
      "Text": "Nazi Germany and Imperial Japan sign the Anti-Comintern Pact. The pact is directed against the Soviet Union and the international Communist movement."
    },
    {
      "Month": "July",
      "Day": 7,
      "Year": 1937,
      "Text": "Japan invades China."
    },
    {
      "Month": "November",
      "Day": 26,
      "Year": 1937,
      "Text": "Italy joins Germany and Japan in the Anti-Comintern Pact."
    },
    {
      "Month": "March",
      "Day": 13,
      "Year": 1938,
      "Text": "Germany incorporates Austria in the Anschluss."
    },
    {
      "Month": "September",
      "Day": 29,
      "Year": 1938,
      "Text": "Germany, Italy, Great Britain, and France sign the Munich agreement which forces the Czechoslovak Republic to cede the Sudetenland, including key Czechoslovak military defense positions, to Nazi Germany."
    },
    {
      "Month": "March",
      "Day": 15,
      "Year": 1939,
      "Text": "Under German pressure, the Slovaks declare their independence and form a Slovak Republic. The Germans occupy the dismantled Czech lands in violation of the Munich agreement and form the Protectorate of Bohemia and Moravia."
    },
    {
      "Month": "March",
      "Day": 31,
      "Year": 1939,
      "Text": "France and Great Britain guarantee the integrity of the borders of the Polish state."
    },
    {
      "Month": "April",
      "Day": 15,
      "Year": 1939,
      "Text": "Fascist Italy invades and annexes Albania."
    },
    {
      "Month": "August",
      "Day": 23,
      "Year": 1939,
      "Text": "Nazi Germany and the Soviet Union sign a non-aggression agreement and a secret protocol dividing eastern Europe into spheres of influence."
    },
    {
      "Month": "September",
      "Day": 1,
      "Year": 1939,
      "Text": "Germany invades Poland, initiating World War II in Europe."
    },
    {
      "Month": "September",
      "Day": 3,
      "Year": 1939,
      "Text": "Honoring their guarantee of Poland’s borders, Great Britain and France declare war on Germany."
    },
    {
      "Month": "September",
      "Day": 17,
      "Year": 1939,
      "Text": "The Soviet Union invades Poland from the east. The Polish government flees into exile via Romania, first to France and then later to Great Britain."
    },
    {
      "Month": "September",
      "Day": 29,
      "Year": 1939,
      "Text": "Warsaw surrenders on September 27. Germany and the Soviet Union divide Poland between them."
    },
    {
      "Month": "November",
      "Day": 30,
      "Year": 1939,
      "Text": "The Soviet Union invades Finland, initiating the so-called Winter War. The Finns sue for an armistice and cede the northern shores of Lake Lagoda to the Soviet Union. They also cede the small Finnish coastline on the Arctic Sea."
    },
    {
      "Month": "April",
      "Day": 9,
      "Year": 1940,
      "Text": "Germany invades Denmark and Norway. Denmark surrenders on the day of the attack. Norway holds out until June 9."
    },
    {
      "Month": "May",
      "Day": 10,
      "Year": 1940,
      "Text": "Germany attacks western Europe, specifically France and the neutral Low Countries (Belgium, the Netherlands, and Luxembourg). Luxembourg is occupied on May 10; the Netherlands surrenders on May 14; and Belgium surrenders on May 28. On June 22, France signs an armistice agreement by which the Germans occupy the northern half of the country and the entire Atlantic coastline. In southern France, a collaborationist regime with its capital in Vichy is established."
    },
    {
      "Month": "June",
      "Day": 10,
      "Year": 1940,
      "Text": "Italy enters the war. Italy invades southern France on June 21."
    },
    {
      "Month": "June",
      "Day": 28,
      "Year": 1940,
      "Text": "The Soviet Union forces Romania to cede the eastern province of Bessarabia and the northern half of Bukovina to Soviet Ukraine."
    },
    {
      "Month": "June",
      "Day": 14,
      "Year": 1940,
      "Text": "The Soviet Union occupies the Baltic states (Estonia, Latvia, and Lithuania) on June 14–18. On July 14–15, it engineers Communist coup d’états in each of these countries and then annexes them as Soviet Republics on August 3–6."
    },
    {
      "Month": "July",
      "Day": 10,
      "Year": 1940,
      "Text": "The air war known as the Battle of Britain ends in defeat for Nazi Germany."
    },
    {
      "Month": "August",
      "Day": 30,
      "Year": 1940,
      "Text": "Second Vienna Award: Germany and Italy arbitrate a decision on the division of the disputed province of Transylvania between Romania and Hungary. The loss of northern Transylvania forces Romanian King Carol to abdicate in favor of his son, Michael, and brings to power a dictatorship under General Ion Antonescu."
    },
    {
      "Month": "September",
      "Day": 13,
      "Year": 1940,
      "Text": "The Italians invade British-controlled Egypt from Italian-controlled Libya."
    },
    {
      "Month": "September",
      "Day": 27,
      "Year": 1940,
      "Text": "Germany, Italy, and Japan sign the Tripartite Pact."
    },
    {
      "Month": "October",
      "Day": 1,
      "Year": 1940,
      "Text": "Italy invades Greece from Albania on October 28."
    },
    {
      "Month": "November",
      "Day": 1,
      "Year": 1940,
      "Text": "Hungary (November 20), Romania (November 23), and Slovakia (November 24) join the Axis."
    },
    {
      "Month": "February",
      "Day": 1,
      "Year": 1941,
      "Text": "The Germans send the Afrika Korps to North Africa to reinforce the faltering Italians."
    },
    {
      "Month": "March",
      "Day": 1,
      "Year": 1941,
      "Text": "Bulgaria joins the Axis."
    },
    {
      "Month": "April",
      "Day": 6,
      "Year": 1941,
      "Text": "–June 1941 Germany, Italy, and Hungary invade Yugoslavia and, together with Bulgaria, dismember it. Yugoslavia surrenders on April 17. Germany and Bulgaria invade Greece in support of the Italians. Resistance in Greece ceases in early June 1941."
    },
    {
      "Month": "April",
      "Day": 10,
      "Year": 1941,
      "Text": "The leaders of the terrorist Ustaša movement proclaim the so-called Independent State of Croatia. Recognized immediately by Germany and Italy, the new state includes the province of Bosnia-Herzegovina. Croatia joins the Axis powers formally on June 15, 1941."
    },
    {
      "Month": "June",
      "Day": 22,
      "Year": 1941,
      "Text": "–November 1941 Nazi Germany and its Axis partners (except Bulgaria) invade the Soviet Union. Finland, seeking redress for the territorial losses in the armistice concluding the so-called Winter War, agrees to participate in the invasion. The Germans quickly overrun the Baltic states and, joined by the Finns, lay siege to Leningrad (St. Petersburg) by September. In the center, the Germans capture Smolensk in early August and drive on Moscow by October. In the south, German and Romanian troops capture Kiev (Kyiv) in September and capture Rostov on the Don River in November."
    },
    {
      "Month": "December",
      "Day": 6,
      "Year": 1941,
      "Text": "A Soviet counteroffensive drives the Germans from the Moscow suburbs in chaotic retreat."
    },
    {
      "Month": "December",
      "Day": 7,
      "Year": 1941,
      "Text": "Japan bombs Pearl Harbor."
    },
    {
      "Month": "December",
      "Day": 8,
      "Year": 1941,
      "Text": "The United States declares war on Japan, entering World War II. Japanese troops land in the Philippines, French Indochina (Vietnam, Laos, Cambodia), and British Singapore. The Japanese occupy the Philippines, Indochina, and Singapore by April 1942 and take control of Burma in May."
    },
    {
      "Month": "December",
      "Day": 13,
      "Year": 1941,
      "Text": "Nazi Germany and its Axis partners declare war on the United States."
    },
    {
      "Month": "May",
      "Day": 30,
      "Year": 1942,
      "Text": "The British bomb Köln (Cologne), in the start of a bombing campaign that brings the war home to Germany. Over the next three years Anglo-American bombing reduces urban Germany to rubble."
    },
    {
      "Month": "June",
      "Day": 1,
      "Year": 1942,
      "Text": "The US Navy halts the Japanese naval advance in the central Pacific at Midway."
    },
    {
      "Month": "June",
      "Day": 28,
      "Year": 1942,
      "Text": "Germany and its Axis partners launch a new offensive in the Soviet Union. German troops fight their way into Stalingrad (Volgograd) on the Volga River by mid-September and penetrate deep into the Caucasus after securing the Crimean Peninsula. With German forces in North Africa having penetrated Egypt, Germany was at the height of its military success in World War II."
    },
    {
      "Month": "August",
      "Day": 9,
      "Year": 1943,
      "Text": "For the first time, Allied forces go on the offensive against Japanese forces by landing on and taking Tulagi, Florida, and Guadalcanal in the Solomon Islands."
    },
    {
      "Month": "October",
      "Day": 24,
      "Year": 1942,
      "Text": "British troops defeat the Germans and Italians at El Alamein in Egypt, sending the Axis forces in chaotic retreat across Libya to the eastern border of Tunisia."
    },
    {
      "Month": "November",
      "Day": 8,
      "Year": 1942,
      "Text": "US and British troops land at several points on the beaches of Algeria and Morocco in French North Africa. The failure of the Vichy French troops to defend against the invasion enables the Allies to move swiftly to the western border of Tunisia and triggers the German occupation of southern France on November 11."
    },
    {
      "Month": "November",
      "Day": 23,
      "Year": 1942,
      "Text": "Soviet troops counterattack, breaking through the Hungarian and Romanian lines northwest and southwest of Stalingrad and trapping the German Sixth Army in the city. Forbidden by Hitler to retreat or try to break out of the Soviet ring, the survivors of the Sixth Army surrender on January 30 and February 2, 1943."
    },
    {
      "Month": "May",
      "Day": 13,
      "Year": 1943,
      "Text": "Axis forces in Tunisia surrender to the Allies, ending the North African campaign."
    },
    {
      "Month": "July",
      "Day": 5,
      "Year": 1943,
      "Text": "The Germans launch a massive tank offensive near Kursk in the Soviet Union. The Soviets blunt the attack within a week and begin an offensive initiative of their own."
    },
    {
      "Month": "July",
      "Day": 10,
      "Year": 1943,
      "Text": "US and British troops land on Sicily. By mid-August, the Allies control Sicily."
    },
    {
      "Month": "July",
      "Day": 25,
      "Year": 1943,
      "Text": "The Fascist Grand Council deposes Benito Mussolini, enabling Italian Marshall Pietro Badoglio to form a new government."
    },
    {
      "Month": "September",
      "Day": 8,
      "Year": 1943,
      "Text": "The Badoglio government surrenders unconditionally to the Allies. The Germans immediately seize control of Rome and northern Italy, establishing a puppet Fascist regime under Mussolini, who is freed from imprisonment by German commandos on September 12."
    },
    {
      "Month": "September",
      "Day": 9,
      "Year": 1943,
      "Text": "Allied troops land on the beaches of Salerno near Naples."
    },
    {
      "Month": "November",
      "Day": 6,
      "Year": 1943,
      "Text": "Soviet troops liberate Kiev."
    },
    {
      "Month": "January",
      "Day": 22,
      "Year": 1944,
      "Text": "Allied troops land successfully near Anzio, just south of Rome."
    },
    {
      "Month": "March",
      "Day": 19,
      "Year": "1944",
      "Text": "Fearing Hungary’s intention to desert the Axis partnership, the Germans occupy Hungary and compel the regent, Admiral Miklos Horthy, to appoint a pro-German minister president."
    },
    {
      "Month": "June",
      "Day": 4,
      "Year": 1944,
      "Text": "Allied troops liberate Rome. Within six weeks, Anglo-American bombers could hit targets in eastern Germany for the first time."
    },
    {
      "Month": "June",
      "Day": 6,
      "Year": 1944,
      "Text": "British, US, and Canadian troops successfully land on the Normandy beaches of France, opening a “Second Front” against the Germans."
    },
    {
      "Month": "June",
      "Day": 22,
      "Year": 1944,
      "Text": "The Soviets launch a massive offensive in eastern Belorussia (Belarus), destroying the German Army Group Center and driving westward to the Vistula River toward Warsaw in central Poland by August 1."
    },
    {
      "Month": "July",
      "Day": 25,
      "Year": 1944,
      "Text": "Allied forces break out of the Normandy beachhead and race eastward towards Paris."
    },
    {
      "Month": "August",
      "Day": 1,
      "Year": 1944,
      "Text": "The Home Army (the non-communist Polish resistance) rises up against the Germans in an effort to liberate Warsaw before the arrival of Soviet troops. The Soviet advance halts on the east bank of the Vistula. On October 5, the Germans accept the surrender of the remnants of the Home Army forces fighting in Warsaw."
    },
    {
      "Month": "August",
      "Day": 15,
      "Year": 1944,
      "Text": "Allied forces land in southern France near Nice and advance rapidly towards the Rhine River to the northeast."
    },
    {
      "Month": "August",
      "Day": 25,
      "Year": 1944,
      "Text": "Allied troops reach Paris. On August 25, Free French forces, supported by Allied troops, enter the French capital. By September, the Allies reach the German border. By December, virtually all of France, most of Belgium, and part of the southern Netherlands are liberated."
    },
    {
      "Month": "August",
      "Day": 23,
      "Year": 1944,
      "Text": "The appearance of Soviet troops on the Prut River induces the Romanian opposition to overthrow the Antonescu regime. The new government concludes an armistice and immediately switches sides in the war. The Romanian turnaround compels Bulgaria to surrender on September 8, and the Germans to evacuate Greece, Albania, and southern Yugoslavia in October."
    },
    {
      "Month": "August",
      "Day": 29,
      "Year": 1944,
      "Text": "Under the leadership of the Slovak National Council, consisting of both Communists and non-Communists, underground Slovak resistance units rise against the Germans and the indigenous fascist Slovak regime. In late October, the Germans capture Banská Bystrica, the headquarters of the uprising, and put an end to organized resistance."
    },
    {
      "Month": "September",
      "Day": 4,
      "Year": 1944,
      "Text": "Finland agrees to sign an armistice with the Soviet Union and to expel German forces."
    },
    {
      "Month": "October",
      "Day": 15,
      "Year": 1944,
      "Text": "The Hungarian fascist Arrow Cross movement carries out a coup d’état with German support to prevent the Hungarian government from pursuing negotiations for surrender to the Soviets."
    },
    {
      "Month": "October",
      "Day": 20,
      "Year": 1944,
      "Text": "US troops land in the Philippines."
    },
    {
      "Month": "December",
      "Day": 16,
      "Year": 1944,
      "Text": "The Germans launch a final offensive in the west, known as the Battle of the Bulge, in an attempt to re-conquer Belgium and split the Allied forces along the German border. By January 1, 1945, the Germans are in retreat."
    },
    {
      "Month": "January",
      "Day": 12,
      "Year": 1945,
      "Text": "The Soviets launch a new offensive, liberating Warsaw and Krakow in January. They capture Budapest after a two-month siege on February 13, driving the Germans and their Hungarian collaborators out of Hungary in early April."
    },
    {
      "Month": "March",
      "Day": 7,
      "Year": 1945,
      "Text": "US troops cross the Rhine River at Remagen."
    },
    {
      "Month": "April",
      "Day": 4,
      "Year": 1945,
      "Text": "The capture of Bratislava forces Slovakia to surrender."
    },
    {
      "Month": "April",
      "Day": 13,
      "Year": 1945,
      "Text": "Soviet forces capture Vienna."
    },
    {
      "Month": "April",
      "Day": 16,
      "Year": 1945,
      "Text": "The Soviets launch their final offensive, encircling Berlin."
    },
    {
      "Month": "April",
      "Day": 1,
      "Year": 1945,
      "Text": "Partisan units, led by Yugoslav Communist leader Josip Tito, capture Zagreb and topple the Ustaša regime. The top Ustaša leaders flee to Italy and Austria."
    },
    {
      "Month": "April",
      "Day": 30,
      "Year": 1945,
      "Text": "Hitler commits suicide."
    },
    {
      "Month": "May",
      "Day": 7,
      "Year": 1945,
      "Text": "Germany signs an unconditional surrender at the headquarters of US General Dwight D. Eisenhower, Commander of Allied forces in northwest Europe, at Reims on May 7. The surrender takes effect on May 8 at 11:01 PM Central European time (CET)."
    },
    {
      "Month": "May",
      "Day": 8,
      "Year": 1945,
      "Text": "Germany signs a second, very similar, document of surrender in Berlin. It also comes into effect on May 8 at 11:01 PM CET. In Moscow, this was already after midnight on May 9."
    },
    {
      "Month": "May",
      "Day": 1,
      "Year": 1945,
      "Text": "Allied troops conquer Okinawa, the last island stop before the main Japanese islands."
    },
    {
      "Month": "August",
      "Day": 6,
      "Year": 1945,
      "Text": "The United States drops an atomic bomb on Hiroshima."
    },
    {
      "Month": "August",
      "Day": 8,
      "Year": 1945,
      "Text": "The Soviet Union declares war on Japan and invades Manchuria."
    },
    {
      "Month": "August",
      "Day": 9,
      "Year": 1945,
      "Text": "The United States drops an atomic bomb on Nagasaki."
    },
    {
      "Month": "September",
      "Day": 2,
      "Year": 1945,
      "Text": "Having agreed in principle to unconditional surrender on August 14, 1945, Japan formally"
    }
  ]